personal = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Иван','Сергей','Екатерина','Ольга','Мария'],
        'Фамилия': ['Петров','Петров','Харитоненко','Житникова','Попова'],
        'Дата рождения' : ['17.08.1987','04.05.1997','01.04.1999','23.02.1972','08.03.1984'],
        'Должность' : ['Повар','Зав производством','Официант','Посудомойщик','Повар'],
        'Зарплата' : ['30000', ' 40000', '50000', '30000', '20000']
}

with open('personal.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{personal}')
        cl.write('\n')
print(personal)